from tensorflow.keras.models import Sequential, Model
from tensorflow.keras.layers import Dense, Dropout, Input


#2-1. 순차적 모델
model = Sequential()
model.add(Dense(10, input_shape=(3,)))
model.add(Dropout(0.2))
model.add(Dense(9))
model.add(Dropout(0.2))
model.add(Dense(1))

model.summary()

# 함수형 모델 구성 : 먼저 레이어 구성 후 이것은 함수형 모델이라고 정의함 (위 시퀄셜 모델과 다르다.)
#######################################################
#2-1. 함수형 모델

input1 = Input(shape=(3,))                         # input_shape=(3,)))
dence1 = Dense(10, name='a1')(input1)              # (Dense(10,
drop1 = Dropout(0.2)(dence1)                       # model.add(Dropout(0.2))
dence2 = Dense(9, name='a2')(drop1)                # model.add(Dense(9))
drop2 = Dropout(0.2)(dence2)                       # model.add(Dropout(0.2))
output1 = Dense(1)(drop2)                          # model.add(Dense(1))

model2 = Model(inputs=input1, outputs=output1)     # 모델 정의

model2.summary()

# Model: "sequential"
# ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━┓
# ┃ Layer (type)                         ┃ Output Shape                ┃         Param # ┃
# ┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━┩
# │ dense (Dense)                        │ (None, 10)                  │              40 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dropout (Dropout)                    │ (None, 10)                  │               0 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_1 (Dense)                      │ (None, 9)                   │              99 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dropout_1 (Dropout)                  │ (None, 9)                   │               0 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_2 (Dense)                      │ (None, 1)                   │              10 │
# └──────────────────────────────────────┴─────────────────────────────┴─────────────────┘
#  Total params: 149 (596.00 B)
#  Trainable params: 149 (596.00 B)
#  Non-trainable params: 0 (0.00 B)
# Model: "functional_5"
# ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━┓
# ┃ Layer (type)                         ┃ Output Shape                ┃         Param # ┃
# ┡━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╇━━━━━━━━━━━━━━━━━┩
# │ input_layer_1 (InputLayer)           │ (None, 3)                   │               0 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ a1 (Dense)                           │ (None, 10)                  │              40 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dropout_2 (Dropout)                  │ (None, 10)                  │               0 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ a2 (Dense)                           │ (None, 9)                   │              99 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dropout_3 (Dropout)                  │ (None, 9)                   │               0 │
# ├──────────────────────────────────────┼─────────────────────────────┼─────────────────┤
# │ dense_3 (Dense)                      │ (None, 1)                   │              10 │
# └──────────────────────────────────────┴─────────────────────────────┴─────────────────┘
#  Total params: 149 (596.00 B)
#  Trainable params: 149 (596.00 B)
#  Non-trainable params: 0 (0.00 B)




